Revit 2027 API
FabricationPart.GetDimensions Method
Note: This API is now obsolete.
 Gets all fabrication dimensions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This method is deprecated in Revit 2027 and may be removed in a later version. Use the method GetDimensionDefinitions instead.")]
public IList<FabricationDimensionDefinition> GetDimensions()
<ObsoleteAttribute("This method is deprecated in Revit 2027 and may be removed in a later version. Use the method GetDimensionDefinitions instead.")>
Public Function GetDimensions As IList(Of FabricationDimensionDefinition)
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2027 and may be removed in a later version. Use the method GetDimensionDefinitions instead.")]
IList<FabricationDimensionDefinition^>^ GetDimensions()
[<ObsoleteAttribute("This method is deprecated in Revit 2027 and may be removed in a later version. Use the method GetDimensionDefinitions instead.")>]
member GetDimensions : unit -> IList<FabricationDimensionDefinition>
Return Value
IList<FabricationDimensionDefinition>
 Returns an array of fabrication dimensions.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace